import React from 'react';
import '../styles/About.css'

const About = () => {
    return (<>

  
            <div class="row justify-content-center">
                <img
                    style={{ height: 280, width: "auto" }}
                    alt='...'
                    src='\Brawlhalla_Logo_100M_Full.webp'
                />
            </div>
      

        <div className={' about card container-sm'}>

            <div className={'card-body'}>
                Brawlhalla - это бесплатный платформер-файтинг с аудиторией более 80 млн. игроков, поддержкой сетевого режима до 8 игроков и полной кроссплатформенной совместимостью. Вступайте в нерейтинговые бои, где каждый сам за себя, участвуйте в рейтинговых сражениях или создайте пользовательскую игру вместе с друзьями. В Brawlhalla регулярно выходят обновления. Сейчас в игре 50 уникальных персонажей, и это число постоянно растет. Сражайтесь ради славы в чертогах Валгаллы!
                <br />
                <br />
                    Особенности:
                <br />  <br />

                - Онлайн-Рейтинговый 1 на 1 и 2 на 2 - Поднимитесь по рейтинговой лестнице, от олова до платины и дальше! Сражайтесь с врагами в одиночку или объединяйтесь с друзьями. Ваши оппоненты будут игроками, близкими к вашему уровню.
                <br />  <br />
                - Каждый сам за себя - случайные матчи, в которых участвуют четыре бойца, но победить может только один.
                <br />  <br />
                - Кросс-платформенные кастомные комнаты - Приглашайте до 8 друзей играющих на разных платформах, огромное разнообразие пользовательских матчей: 4 на 4, 1 на 3, 2 на 2, "каждый сам за себя" и многое другое.
                <br />  <br />
                - Множество игровых режимов - Brawlball, Bombsketball, Захват Флага, Kung-Foot и многие другие веселые режимы игры для вечеринок.
                <br />  <br />
                - Тренировочная комната - Практикуйтесь, проверяйте настройки и комбинации внутри Тренировочной комнаты! Иследуйте данные о фреймах, хитбоксах, хартбоксах и отточите свои навыки.
                <br />  <br />

                В добавок: лучшее в своем классе развлечение, записывайте матчи и играйте. Десятки карт. Режим одиночного турнира. Онлайн битва недели. Экспериментальный режим. Миллионы игроков для быстрого матчмейкинга. Региональные серверы для онлайн-матчей с низкой задержкой. Частые обновления. Тонны киберспортивных событий и турниров. Отличная поддержка клавиатуры и контроллеров. Карьера и классные награды за успехи. Ранковые сезоны. Дружелюбные разработчики. Веселая, честная, бесплатная игра. И многое другое.
                <br />  <br />

                Как мы сделали игру бесплатной.


                Brawlhalla всегда будет на 100% бесплатной игрой, без преимуществ оплаты за выигрыш и без внутриигровых покупок, удерживающих вас от нормалных боев. Ни один из премиум-контента не влияет на игровой процесс.


                Что касается легенд, восемь бесплатных игровых персонажей меняются каждую неделю. Вы можете заработать золото, чтобы разблокировать больше легенд, играя в любой режим игры.


                Вы также можете ознакомиться с нашим «Паком всех легенд», который сразу же разблокирует каждого персонажа, которого мы когда-либо делали и сделаем, навсегда. Все в вкладке «Легенды» в игровом магазине будут вашими. Обратите внимание, пак не разблокирует кроссоверы.
            </div>
        </div>
    </>


    );
};

export default About;